### Preparation

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r"C:\Users\dioog\Instacart Basket Analysis"

In [3]:
customers = pd.read_csv(os.path.join(path, "02 Data", "01 Original data", "customers.csv"))

In [4]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
customers.shape

(206209, 10)

### Wrangling customers

##### renaming columns

In [5]:
customers.rename(columns = {"First Name" : "name"}, inplace = True)

In [6]:
customers.rename(columns = {"Surnam" : "surname"}, inplace = True)

In [7]:
customers.rename(columns = {"STATE" : "state"}, inplace = True)

In [8]:
customers.rename(columns = {"Gender" : "gender"}, inplace = True)

In [9]:
customers.rename(columns = {"Age" : "age"}, inplace = True)

In [10]:
customers.head()

,user_id,name,surname,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

##### checking for issues

In [11]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   name          194950 non-null  object
 2   surname       206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [ ]:
# there is some problems with [name]

In [18]:
customers.dtypes

user_id          int64
name            object
surname         object
gender          object
state           object
age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [16]:
customers.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [22]:
customers["gender"].value_counts()

Male      104067
Female    102142
Name: gender, dtype: int64

In [23]:
customers["state"].value_counts()

District of Columbia    4044
Idaho                   4044
California              4044
Alaska                  4044
Indiana                 4044
Hawaii                  4044
Georgia                 4044
Delaware                4044
Arkansas                4044
Arizona                 4044
Colorado                4044
Alabama                 4044
Illinois                4044
Florida                 4044
Iowa                    4044
Connecticut             4044
Montana                 4043
New Mexico              4043
Kentucky                4043
Maryland                4043
Oklahoma                4043
Oregon                  4043
Nebraska                4043
Pennsylvania            4043
Washington              4043
Virginia                4043
West Virginia           4043
South Dakota            4043
Minnesota               4043
Missouri                4043
Wisconsin               4043
Rhode Island            4043
Utah                    4043
Ohio                    4043
New Hampshire           4043
New York                4043
Michigan                4043
Mississippi             4043
Vermont                 4043
South Carolina          4043
Texas                   4043
Kansas                  4043
Tennessee               4043
Massachusetts           4043
Nevada                  4043
New Jersey              4043
Maine                   4043
Wyoming                 4043
North Carolina          4043
North Dakota            4043
Louisiana               4043
Name: state, dtype: int64

In [ ]:
# that is a strange distribution

In [24]:
customers["fam_status"].value_counts()

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64

In [12]:
# checking for mixed data columns

for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

name

In [13]:
# fixing [name]

customers["name"] = customers["name"].astype('str')

In [14]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   name          206209 non-null  object
 2   surname       206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [ ]:
# problems with [name] solved

In [15]:
# looking for missing values

customers.isnull().sum()

user_id         0
name            0
surname         0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [16]:
# handling duplicates

#customers_dups = df_prods_clean[df_prods_clean.duplicated()]

customers_dups = customers[customers.duplicated()]

In [17]:
customers_dups

Empty DataFrame
Columns: [user_id, name, surname, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

In [ ]:
# no duplicates found

### Exporting customers_checked

In [40]:
customers.to_csv(os.path.join(path, "02 Data", "02 prepared data", "customers_checked.csv"))

### Merging

In [3]:
ords_prods_merge_ss = pd.read_csv(os.path.join(path, "02 Data", "02 Prepared data", "orders_products_merged_Vs_Small.csv"))

In [9]:
ords_prods_merge_ss.columns

Index(['Unnamed: 0', 'Unnamed: 0.1', 'Unnamed: 0_x', 'Unnamed: 0.1.1',
       'order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour_of_day', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', '_merge_old', 'Unnamed: 0_y',
       'product_name', 'aisle_id', 'department_id', 'prices', '_merge',
       'price_range_loc', 'Busiest_day', 'Busiest_days',
       'busiest_period_of_day', 'max_order', 'Loyalty_flag', 'spending_flag',
       'avg_expense', 'Spending_flag', 'median_frequency', 'Frequency_flag'],
      dtype='object')

In [10]:
ords_prods_merge_ss = ords_prods_merge_ss.drop(columns = ["_merge_old", "_merge"])

In [5]:
customers = pd.read_csv(os.path.join(path, "02 Data", "02 Prepared data", "customers_checked.csv"))

In [11]:
ords_prods_custs = ords_prods_merge_ss.merge(customers, on = "user_id", indicator = True)

In [12]:
ords_prods_custs.head()

,Unnamed: 0_x,Unnamed: 0.1,Unnamed: 0_x,Unnamed: 0.1.1,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,...,name,surname,gender,state,age,date_joined,n_dependants,fam_status,income,_merge
0,0,0,0,0,2539329,1,1,2,8,NaN,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,1,1,1,1,2398795,1,2,3,7,15.0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,3,3,3,3,2254736,1,4,4,7,29.0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,5,5,5,5,3367565,1,6,2,7,19.0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,7,7,7,7,3108588,1,8,1,14,14.0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [13]:
ords_prods_custs["_merge"].value_counts (dropna = False)

both          9717350
right_only          0
left_only           0
Name: _merge, dtype: int64

### Exporting ords_prods_custs

In [14]:
ords_prods_custs.to_csv(os.path.join(path, "02 Data", "02 prepared data", "orders_products_customers.csv"))

In [15]:
ords_prods_custs.to_pickle(os.path.join(path, "02 Data", "02 prepared data", "orders_products_customers.pkl"))